from graph import graph

graph1 = {
    '종류': '선그래프',
    'x': [1, 2, 3],
    'y': [4, 5, 6],
    '옵션': {
        '제목': '샘플 선그래프',
        'label' : '예시 데이터',

        'marker': {
            '문양': 'x', 
            '크기': 10, 
            '색': 'red',
            '테두리 색': 'black'
            },

        'line':{    
            'linestyle':'--',
            'linewidth': 5,
            'color': 'pink',
            'alpha': 0.7
        },

        'x축': {
            '이름': '시간',
            '색': 'red',
            '정렬': 'right',
            '눈금': [1, 2, 3]
        },

        'y축': {
            '이름': '온도',
            '색': 'blue',
            '정렬': 'top',
            '눈금': [4, 5, 6]
        },

        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': 'white',
        }
        
    }
}

graph2 = {
    '종류': '막대그래프',
    'x': ['이운길', '최현경', '류지성'],
    'y': [150, 200, 175],
    '옵션': {
        '제목' : '샘플 막대그래프',
        'label' : '예시 데이터',
        'bar':{
            'color': 'blue',
            'alpha': 0.7,
            'width': 0.5,
            'edgecolor' : 'black',
        },
        'x축': {
            '이름': '이름',
            '색': 'red',
            '정렬': 'right',
            '눈금': ['이운길', '최현경', '류지성']
        },
        'y축': {
            '이름': '온도',
            '색': 'blue',
            '정렬': 'top',
            '눈금': [4, 5, 6]
        },
        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': 'white',
        }
        
    }
}
graph3 = {
    '종류': '산점도그래프',
    'x': [1,2,3,4,5],
    'y': [10, 20, 14, 30, 25],
    '옵션': {
        'color': 'orange',
        'marker': {
            '문양': 'o', 
            '크기': 10, 
            '색': 'red',
            '테두리 색': 'black'
            },
        'width': 0.5,
        'alpha' : 0.7,
        'x축': {
            '이름': '시간',
            '색': 'red',
            '정렬': 'right',
            '눈금': [1, 2, 3]
        },
        'y축': {
            '이름': '온도',
            '색': 'blue',
            '정렬': 'top',
            '눈금': [4, 5, 6]
        },
        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': 'white',
        }
        
    }
}

g = graph()
g.draw(graph1)
g.draw(graph2)
g.draw(graph3)