from graph import graph

graph1 = {
    '종류': '선그래프',
    'x': ['이운길', '최현경', '류지성'],
    'y': [160, 150, 170],
    '옵션': {
        '제목': '키 선그래프',
        'label' : '키',

        'marker': {
            '문양': 'o',
            '크기': 12, 
            '색': '검정',
            },

        'line':{    
            'linestyle':'-',
            'linewidth': 5,
            'color': '노랑',
            'alpha': 0.7
        },

        'x축': {
            '이름': '이름',
            '색': '빨강',
            '정렬': 'right',
            '눈금': ['이운길', '최현경', '류지성']
        },

        'y축': {
            '이름': '키',
            '색': '파랑',
            '정렬': 'top',
            '눈금': [160, 150, 170]
        },

        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': '파랑',
            '내부 배경색' : '흰색'
        }
    }
}

graph2 = {
    '종류': '막대그래프',
    'x':  ['이운길', '최현경', '류지성'],
    'y': [60, 50, 70],
    '옵션': {
        '제목' : '몸무게 막대 그래프',
        'label' : '몸무게',
        'bar':{
            'color': '분홍',
            'alpha': 0.7,
            'width': 0.5,
        },
        'x축': {
            '이름': '이름',
            '색': '빨강',
            '정렬': 'right',
            '눈금': ['이운길', '최현경', '류지성']
        },
        'y축': {
            '이름': '몸무게',
            '색': '파랑',
            '정렬': 'top',
            '눈금': [60, 50, 70]
        },
        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': '흰색',
            '내부 배경색' : '흰색'
        }
     }
}
graph3 = {
    '종류': '산점도그래프',
    'x': ['이운길', '최현경', '류지성'],
    'y': [3,4,2],
    '옵션': {
        '제목' : '학년 산점도 그래프',
        'label' : '학년',
        'color': '빨강',
        'marker': {
            '문양': 'o', 
            '크기': 30, 
            '색': '파랑'
            },
        'width': 0.5,
        'alpha' : 0.7,
        'x축': {
            '이름': '시간',
            '색': '빨강',
            '정렬': 'right',
            '눈금': ['이운길', '최현경', '류지성']
        },
        'y축': {
            '이름': '온도',
            '색': '파랑',
            '정렬': 'top',
            '눈금': [3,4,2]
        },
        '출력': {
            '범례 위치': 'upper right',
            '그래프 크기': [6, 6],
            '해상도': 100,
            '배경색': '흰색',
            '내부 배경색' : '흰색'
        }
    }
}

g = graph()
g.draw(graph1)
g.save(graph1)
g.draw(graph2)
g.draw(graph3)